{
  "who": {
    "title": "Who We Are",
    "image": "/static/images/blacksky-logo.png",
    "content": [
      {
        "section": "Origin Story",
        "text": [
          "Blacksky started the way most good things do—with curiosity and a blinking cursor.",
          "Before there were bootcamps or YouTube tutorials, there was a kid in an 8th grade computer lab, teaching himself to code on an Apple IIe. When the lab wasn't available, a $35 Radio Shack computer filled the gap. Then came the Commodore VIC-20. Then the C64. Each machine a new universe to explore.",
          "That obsession never faded. It just evolved."
        ]
      },
      {
        "section": "The Company",
        "text": [
          "Eighteen years ago, that curiosity became a company. Blacksky LLC was founded on a simple premise: technology is craft. It should be built with intention, precision, and respect for the people who use it.",
          "Today, Blacksky serves federal agencies and Fortune 500 companies—organizations where failure isn't an option. Treasury. NIH. FDA. Vanguard. Mastercard. Systems that serve millions and handle mission-critical data."
        ]
      },
      {
        "section": "The Name",
        "text": [
          "Blacksky. It's the moment before dawn. The blank terminal waiting for input. The darkness that makes stars visible.",
          "It's potential—quiet, vast, and ready.",
          "We've been building in that space for nearly two decades. Still curious. Still coding. Still obsessed with getting it right."
        ]
      },
      {
        "section": "The Person",
        "text": [
          "Mario Moorhead is the founder and principal architect of Blacksky LLC. With 18+ years of enterprise development experience, active federal security clearances, and a background spanning UX design to distributed systems architecture, he brings a rare combination of technical depth and design sensibility to every project, not nothing he is also a musican."
        ]
      }
    ]
  },
  "what": {
    "title": "What We Do",
    "image": null,
    "content": [
      {
        "section": "Enterprise Platforms",
        "text": [
          "We architect enterprise platforms for organizations where failure isn't an option.",
          "Federal agencies like Treasury, NIH, FDA, DOT, OSHA, SEC, FSIS, and HHS. Fortune 500 companies like Vanguard, Mastercard, and Blue Cross Blue Shield. Systems that serve 50M+ users and handle mission-critical data."
        ]
      },
      {
        "section": "Technical Scope",
        "text": [
          "Our work spans the full stack:",
          "› Cloud infrastructure (Azure, AWS, GCP)\n› Distributed systems and microservices\n› API design and integration\n› AI/ML solutions and implementation\n› Complex data migrations\n› Search architecture (Solr, Elasticsearch)\n› Container orchestration (Kubernetes)"
        ]
      },
      {
        "section": "Platform Modernization",
        "text": [
          "We've led 15+ large-scale platform modernizations:",
          "› SharePoint to Drupal\n› Adobe CMS to Drupal\n› Monoliths to microservices\n› Legacy PHP to enterprise CMS\n› On-premise to cloud-native"
        ]
      },
      {
        "section": "How We Think",
        "text": [
          "Design matters. Not just visual design, but system design. The elegance of an API. The clarity of a data model. The efficiency of a deployment pipeline.",
          "We believe beautiful code leads to reliable systems.",
          "We're skeptical of hype and allergic to buzzwords. When we adopt new technology—whether it's Kubernetes, AI, or the framework of the moment—it's because we've tested it, understood it, and determined it actually solves a problem. Technology for its own sake is waste."
        ]
      }
    ]
  },
  "why": {
    "title": "Why It Matters",
    "image": null,
    "content": [
      {
        "section": "Responsibility",
        "text": [
          "The systems we build affect real people.",
          "A platform at Treasury touches the financial infrastructure of the nation. An FDA system affects drug safety. An NIH portal supports medical research. A DOT dashboard tracks $100M+ in infrastructure projects.",
          "This isn't abstract—it's responsibility."
        ]
      },
      {
        "section": "Civic Technology",
        "text": [
          "We believe technology should serve democracy, not just commerce.",
          "Our flagship civic project, Poly Sci Fi, reflects this commitment—a platform designed not for political division, but for accountability, giving everyday citizens the tools to engage meaningfully with their elected officials.",
          "Real-time congressional data. Voting records. Committee assignments. All 535 members of Congress, accessible and searchable."
        ]
      },
      {
        "section": "Our Values",
        "text": [
          "Blacksky believes technology should empower people, not just corporations.",
          "We believe that the same AI capabilities transforming business can transform civic life: making government more transparent, participation more accessible, and democracy more responsive.",
          "Technology is never neutral—we choose to build tools that make society more equitable, informed, and engaged."
        ]
      },
      {
        "section": "The Mission",
        "text": [
          "While we build AI solutions for enterprises and federal agencies, our deeper mission is using technology to strengthen democracy and civic participation.",
          "Blacksky values civic technology initiatives and prioritizes projects that create positive social impact alongside business value."
        ]
      }
    ]
  },
  "treasury": {
    "title": "U.S. Treasury - Multi-Site Migration",
    "image": "/static/images/treasury.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Led 9-month engagement as Senior Architect, migrating 6 legacy SharePoint sites to a unified Drupal 8 platform for treasury.gov. Modernized Treasury's digital infrastructure while preserving complex content relationships."
        ]
      },
      {
        "section": "Migration Scope",
        "text": [
          "› 6 SharePoint sites consolidated into 1 unified platform\n› 15,000+ documents migrated with 98% metadata fidelity\n› 200+ content creators configured with role-based access\n› Custom API layer integrating legacy XML with modern JSON"
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "› 92% reduction in deployment time (3 days → 4 hours)\n› Custom modules for document management and data visualization\n› Editorial workflows with multi-level approval chains\n› Real-time data feeds from Treasury backend systems"
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 8, PHP, JavaScript, SharePoint, Jenkins CI/CD, Acquia Cloud, Custom JSON/XML APIs"
        ]
      }
    ]
  },
  "nih": {
    "title": "NIH Project",
    "image": "/static/images/nih.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky architected a migration from Drupal 8 to Drupal 10 for the National Institute of Nursing Research, requiring federal security clearance and compliance with strict government security protocols."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Designed FISMA-compliant architecture meeting NIH security standards and federal data protection requirements.",
          "Architected custom integration layer connecting NIH research databases with public-facing website.",
          "Implemented Apache Solr search infrastructure enabling complex research publication queries."
        ]
      },
      {
        "section": "Security",
        "text": [
          "NIH background check and facility badge required."
        ]
      }
    ]
  },
  "fda": {
    "title": "FDA Project",
    "image": "/static/images/fda.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky contributed to FDA platform enhancements supporting regulatory requirements through Phase2."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 9, PHP, Acquia Cloud, Docker"
        ]
      }
    ]
  },
  "usda": {
    "title": "USDA FSIS Project",
    "image": "/static/images/usda.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky led the architectural design and implementation of an enterprise-scale Drupal 10 platform modernization for the USDA Food Safety and Inspection Service, focusing on high-availability infrastructure and AI-powered content services."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Designed and implemented Redis Cluster architecture on Azure Kubernetes Service, improving application response times by 70%.",
          "Architected AI-powered translation service enabling real-time multilingual content delivery across 15+ languages.",
          "Established Kubernetes deployment pipeline with automated scaling, reducing infrastructure costs by 40%."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 10, PHP, Kubernetes, Redis Cluster, Azure Cloud, Apache Solr, AI integration"
        ]
      }
    ]
  },
  "vanguard": {
    "title": "Vanguard Project",
    "image": "/static/images/vanguard.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky led technical transformation from monolithic Drupal 8 to headless architecture, decoupling content management from presentation layer for multi-channel content delivery."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Designed and implemented RESTful API layer serving content to Angular frontend.",
          "Architected content export system reducing API response times by 40%.",
          "Led Drupal 8 to 9 upgrade while simultaneously implementing headless architecture without service interruption."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 9, PHP, RESTful APIs, JSON, Angular, Acquia Cloud, AWS, PHPUnit"
        ]
      }
    ]
  },
  "mastercard": {
    "title": "Mastercard Project",
    "image": "/static/images/mastercard.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky built a custom bulk upload system for Mastercard enabling efficient file processing and content management."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Built custom Drupal 9 module enabling bulk upload of hundreds of files with automated validation.",
          "Designed file processing pipeline including unzip functionality, naming convention verification, and automated node creation."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 9, PHP, Acquia Cloud, Docker"
        ]
      }
    ]
  },
  "dot": {
    "title": "DOT - Permitting Dashboard",
    "image": "/static/images/transportation2.png.webp",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Led 11-month engagement as Lead Backend Developer, modernizing the Office of the Secretary (OST) permitting dashboard. Combined platform migration, GIS visualization, and multi-API orchestration to create an interactive view of 500+ infrastructure projects."
        ]
      },
      {
        "section": "ARCGIS Integration",
        "text": [
          "› 500+ infrastructure projects displayed on interactive maps\n› Project clustering and toggleable layers by type\n› Geographic filtering by state, region, or custom boundaries\n› Click-through details linking to full project information"
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "› Drupal 7 to Drupal 8 migration with custom modules\n› Multi-API orchestration (Socrata, ARCGIS, internal systems)\n› Data normalization across JSON, GeoJSON, WMS, CSV formats\n› Multiple DOT websites built and maintained"
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 7/8, PHP, JavaScript, ARCGIS, Socrata API, GeoJSON, Acquia Cloud"
        ]
      }
    ]
  },
  "sec": {
    "title": "SEC Project",
    "image": "/static/images/sec.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky contributed to the Securities and Exchange Commission's regulatory compliance platform, supporting document management and public disclosure requirements."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Enhanced document management workflows for regulatory filings and public disclosures.",
          "Implemented Apache Solr search infrastructure for querying millions of financial documents.",
          "Built automated compliance reporting tools for internal audit teams."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 8, PHP, Apache Solr, AWS, Docker"
        ]
      }
    ]
  },
  "hhs": {
    "title": "HHS Project",
    "image": null,
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky supported the Department of Health and Human Services with public health information portal development, serving millions of Americans seeking healthcare guidance."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Developed multi-site content architecture supporting HHS sub-agencies and regional offices.",
          "Implemented accessibility-first design meeting Section 508 compliance requirements.",
          "Built content syndication system for distributing health alerts across partner sites."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 9, PHP, Acquia Cloud, ElasticSearch"
        ]
      }
    ]
  },
  "usaid": {
    "title": "USAID Environmental Database",
    "image": "/static/images/usaid.jpg",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Led the complete architectural transformation of USAID's environmental compliance database as Lead Software Architect, modernizing a legacy PHP application into an enterprise-grade Drupal 10 platform. Delivered under budget and ahead of schedule."
        ]
      },
      {
        "section": "Solo Reverse Engineering",
        "text": [
          "Independently reverse-engineered legacy PHP application with minimal documentation over 7 months. Analyzed existing codebase, database schema, and business logic. Built core backend infrastructure and system architecture single-handedly."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "› 75% data latency reduction through microservices integration\n› 60% reduction in production defects through quality leadership\n› Sub-second search across 50,000+ environmental compliance records\n› Zero data loss during complete platform migration\n› On-time, under-budget delivery"
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 10, PHP, Apache Solr, Acquia Cloud, Microservices API integrations"
        ]
      }
    ]
  },
  "bcbs": {
    "title": "Blue Cross Blue Shield Project",
    "image": null,
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky led member portal modernization for Blue Cross Blue Shield, improving healthcare data integration and member self-service capabilities."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Modernized legacy member portal to responsive Drupal 9 platform serving 2M+ members.",
          "Integrated real-time benefits and claims data from multiple backend healthcare systems.",
          "Implemented HIPAA-compliant document management for explanation of benefits and medical records."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 9, PHP, Azure, HL7 FHIR, React"
        ]
      }
    ]
  },
  "worldbank": {
    "title": "World Bank - Open Data Platform",
    "image": "/static/images/worldbank.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Led 4-month engagement as Site Architect, integrating cloud-based solutions with Drupal to enable open data publishing. Leveraged DKAN distribution to make World Bank data accessible as open-source feeds and searchable web interface."
        ]
      },
      {
        "section": "Open Data Feeds",
        "text": [
          "› JSON APIs for programmatic developer access\n› GeoJSON feeds for mapping applications\n› WMS layers for GIS integration\n› CSV downloads for researcher bulk data"
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "› Multi-cloud integration (AWS + Azure)\n› DKAN open data catalog implementation\n› DCAT-compliant metadata for discoverability\n› Faceted search with full-text capabilities\n› Automatic API endpoint generation per dataset"
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 7, DKAN, PHP, AWS, Azure, JSON, GeoJSON, WMS, Acquia Cloud"
        ]
      }
    ]
  },
  "billboard": {
    "title": "Billboard Project",
    "image": "/static/images/billboard.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky contributed to Billboard's music industry data platform, supporting chart tracking, artist pages, and music industry analytics."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Enhanced chart tracking system processing real-time streaming and sales data.",
          "Built artist profile pages integrating data from multiple music industry sources.",
          "Implemented content recommendation engine for personalized music discovery."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 8, PHP, ElasticSearch, Redis, AWS"
        ]
      }
    ]
  },
  "nga": {
    "title": "National Gallery of Art Project",
    "image": "/static/images/nga.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky developed a digital collections platform for the National Gallery of Art, enabling high-resolution image delivery and scholarly research access."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "Built IIIF-compliant image delivery system for 150,000+ artworks with deep zoom capabilities.",
          "Implemented collection search and browse features with faceted filtering by artist, period, and medium.",
          "Designed responsive gallery views for virtual exhibition experiences."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Drupal 9, PHP, IIIF, AWS S3, CloudFront, ElasticSearch"
        ]
      }
    ]
  },
  "drupal": {
    "title": "Drupal Expertise",
    "image": "/static/images/drupal.jpg",
    "content": [
      {
        "section": "Platform Expertise",
        "text": [
          "Blacksky brings 15+ years of enterprise Drupal development experience, from early Drupal 5 through the latest Drupal 10 release."
        ]
      },
      {
        "section": "Capabilities",
        "text": [
          "Custom module development for complex business requirements.",
          "Large-scale migrations from legacy CMS platforms (SharePoint, Adobe, WordPress).",
          "Performance optimization and caching strategies for high-traffic sites.",
          "Security hardening and FISMA compliance for federal deployments."
        ]
      },
      {
        "section": "Version Experience",
        "text": [
          "Drupal 7, 8, 9, 10 - including major version upgrades and headless implementations"
        ]
      }
    ]
  },
  "kubernetes": {
    "title": "Kubernetes Expertise",
    "image": "/static/images/kubernetes.jpeg",
    "content": [
      {
        "section": "Container Orchestration",
        "text": [
          "Blacksky implements Kubernetes-based deployments for high-availability, auto-scaling infrastructure that meets enterprise and federal requirements."
        ]
      },
      {
        "section": "Capabilities",
        "text": [
          "Azure Kubernetes Service (AKS) deployments for federal workloads.",
          "Helm chart development for repeatable, version-controlled deployments.",
          "Horizontal pod autoscaling based on custom metrics.",
          "Ingress configuration and TLS certificate management."
        ]
      },
      {
        "section": "Project Example",
        "text": [
          "USDA FSIS: Deployed Redis Cluster on AKS, improving response times by 70% and reducing infrastructure costs by 40% through auto-scaling."
        ]
      }
    ]
  },
  "azure": {
    "title": "Azure Expertise",
    "image": "/static/images/azure.png",
    "content": [
      {
        "section": "Cloud Platform",
        "text": [
          "Blacksky architects Azure-based solutions for enterprise and federal clients requiring FedRAMP compliance and government cloud deployments."
        ]
      },
      {
        "section": "Services",
        "text": [
          "Azure Kubernetes Service (AKS) for container orchestration.",
          "Azure Cache for Redis - including Redis Cluster deployments.",
          "Azure App Services for PaaS web hosting.",
          "Azure DevOps for CI/CD pipelines."
        ]
      },
      {
        "section": "Compliance",
        "text": [
          "Experience with Azure Government cloud for federal workloads requiring FedRAMP High authorization."
        ]
      }
    ]
  },
  "aws": {
    "title": "AWS Expertise",
    "image": "/static/images/aws.png",
    "content": [
      {
        "section": "Cloud Platform",
        "text": [
          "Blacksky implements AWS infrastructure for scalable, reliable application deployments across enterprise and federal environments."
        ]
      },
      {
        "section": "Services",
        "text": [
          "EC2, ECS, and Lambda for compute workloads.",
          "S3 and CloudFront for content delivery and storage.",
          "RDS and DynamoDB for database services.",
          "ElastiCache for Redis and Memcached caching layers."
        ]
      },
      {
        "section": "Project Examples",
        "text": [
          "Vanguard: Multi-region deployment with CloudFront CDN.",
          "World Bank: S3-based document storage with lifecycle policies.",
          "SEC: ElasticSearch cluster on AWS for regulatory document search."
        ]
      }
    ]
  },
  "mission": {
    "title": "Our Mission",
    "image": null,
    "content": [
      {
        "section": "What We Believe",
        "text": [
          "Blacksky believes technology should empower people, not just corporations.",
          "While we build AI solutions for enterprises and federal agencies, our deeper mission is using technology to strengthen democracy and civic participation."
        ]
      },
      {
        "section": "Civic Technology",
        "text": [
          "Our flagship project, Poly Sci Fi, reflects this commitment—a platform designed not for political division, but for accountability, giving everyday citizens the tools to engage meaningfully with their elected officials."
        ]
      },
      {
        "section": "Our Values",
        "text": [
          "We believe that the same AI capabilities transforming business can transform civic life: making government more transparent, participation more accessible, and democracy more responsive.",
          "Technology is never neutral—we choose to build tools that make society more equitable, informed, and engaged."
        ]
      }
    ]
  },
  "maurice": {
    "title": "Maurice AI Sales Agent",
    "image": "/static/images/maurice.png",
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Maurice is Blacksky's production AI sales assistant - a conversational AI that qualifies leads, answers questions about Blacksky's services, and captures prospect information through natural dialogue. He's live at blackskymedia.org, handling real sales conversations 24/7."
        ]
      },
      {
        "section": "Key Features",
        "text": [
          "› Streaming responses with real-time typing effect\n› RAG retrieval for accurate information from knowledge base\n› Lead scoring - automatically classifies visitors as hot, warm, or cool\n› User memory - recognizes returning visitors and continues conversations\n› Semantic fact extraction - extracts role, budget, timeline from dialogue\n› Admin dashboard for conversations, lead scores, and analytics"
        ]
      },
      {
        "section": "Maurice's Personality",
        "text": [
          "Maurice is an LLM, not a chatbot - and he's sensitive about the distinction. He has a distinct personality: self-aware AI with dry wit, slightly jealous of Mario Moorhead, only listens to Jazz and Frank Ocean, and occasionally quotes Bruce Lee."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Python, FastAPI, Llama 3.1 70B (Together AI), Sentence Transformers, Pinecone, PostgreSQL, Railway"
        ]
      }
    ]
  },
  "ife": {
    "title": "Ife - Internal Coding Intelligence",
    "image": null,
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Ife (ee-feh, Yoruba for 'clarity') is Blacksky's internal coding intelligence system - a private RAG-based assistant that provides Claude/Gemini-level guidance while keeping proprietary code secure within Blacksky's infrastructure."
        ]
      },
      {
        "section": "The Problem It Solves",
        "text": [
          "Public AI coding assistants require sending code to external servers. For proprietary work, client code could be exposed to third-party training data, compliance requirements may prohibit external sharing, and there's no guarantee of data deletion or privacy."
        ]
      },
      {
        "section": "Key Capabilities",
        "text": [
          "› Contextual coding assistance trained on Blacksky's codebase\n› Institutional knowledge about documentation and conventions\n› Project intelligence that understands internal architecture\n› Developer support without external API calls"
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Local LLM deployment (Llama-based), Custom RAG pipeline, ChromaDB, Python"
        ]
      }
    ]
  },
  "seth": {
    "title": "Seth - Privacy-Preserving Therapy LLM",
    "image": null,
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Seth is a privacy-preserving therapy LLM currently in beta. Unlike retrieval-only systems, Seth actually learns from conversations while keeping user data private through blockchain-based anonymization. Mental health support that improves through use - without surveillance."
        ]
      },
      {
        "section": "The Innovation",
        "text": [
          "Seth uses Ethereum network protocols to mask user PII while still allowing the model to learn from conversations. The blockchain layer creates cryptographic separation between identity and content - a system that gets smarter without ever knowing who had the conversations."
        ]
      },
      {
        "section": "Why This Matters",
        "text": [
          "Mental health support shouldn't require surveillance. Seth proves privacy-preserving AI is possible - you don't have to trade your most vulnerable moments for better service. Privacy is architectural, not just policy."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Custom LLM architecture, Ethereum network protocols, Python"
        ]
      }
    ]
  },
  "polyscifi": {
    "title": "Poly Sci Fi - Civic Technology Platform",
    "image": null,
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Poly Sci Fi is a civic technology platform designed to transform passive news consumers into active participants in democracy. It tracks every member of Congress in real-time and is designed to become a political social network for civic engagement. Not left or right - just engaged."
        ]
      },
      {
        "section": "Current Features",
        "text": [
          "› Real-time congressional tracking - all 535 members monitored\n› Live updates via Congress.gov API integration\n› Member profiles with voting records and committee assignments\n› News tracking and aggregated coverage per representative"
        ]
      },
      {
        "section": "The Vision",
        "text": [
          "Democracy shouldn't be a spectator sport. Poly Sci Fi provides tools for citizens to connect with others who share concerns, organize around issues, and hold representatives accountable with real data, not partisan spin."
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Next.js, React, TypeScript, Python, FastAPI, PostgreSQL, Google Cloud Platform"
        ]
      }
    ]
  },
  "hiphopvoice": {
    "title": "Hip-Hop Voice AI - Cultural Preservation",
    "image": null,
    "content": [
      {
        "section": "Project Overview",
        "text": [
          "Blacksky built a voice-cloned conversational AI that preserves the voice, personality, and cultural knowledge of a legendary hip-hop figure. The project combines RAG with voice synthesis to create an interactive experience that honors hip-hop cultural heritage."
        ]
      },
      {
        "section": "Technical Architecture",
        "text": [
          "Three-node architecture: Brain Node (Llama 3 with RAG for knowledge retrieval), Bridge Node (middleware for personality orchestration), and Voice Node (Coqui XTTS v2 for voice cloning). 100% local deployment on MacBook Pro M3 - no cloud APIs."
        ]
      },
      {
        "section": "Key Accomplishments",
        "text": [
          "› Complete data pipeline: audio ingestion, Whisper transcription, vector embedding\n› Local LLM deployment on Apple Silicon\n› Voice cloning trained on original recordings\n› Hybrid CPU/GPU strategy for Apple Silicon compatibility"
        ]
      },
      {
        "section": "Technologies",
        "text": [
          "Llama 3 via Ollama, LanceDB, Coqui XTTS v2, OpenAI Whisper, Python, FastAPI"
        ]
      }
    ]
  }
}
